whiteb3ar/hoverboard-firmware-hack-FOC/Src/Platform/Gd32F130C8T6/setup.c
  // Configure ADC clock (APB2 clock is DIV1 -> 72MHz, ADC clock is DIV6 -> 12MHz)
	rcu_adc_clock_config(RCU_ADCCK_APB2_DIV6);
	
	// Interrupt channel 0 enable
	TARGET_nvic_irq_enable(DMA_Channel0_IRQn, 1, 0);
	
	// Initialize DMA channel 0 for ADC
	dma_deinit(DMA_CH0);
	
	dma_init_struct_adc.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_init_struct_adc.memory_addr = (uint32_t)&adc_buffer;
	dma_init_struct_adc.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_init_struct_adc.memory_width = DMA_MEMORY_WIDTH_16BIT;
	dma_init_struct_adc.number = 2;
	dma_init_struct_adc.periph_addr = (uint32_t)&TARGET_ADC_RDATA;
	dma_init_struct_adc.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_init_struct_adc.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
	dma_init_struct_adc.priority = DMA_PRIORITY_ULTRA_HIGH;
	dma_init(DMA_CH0, &dma_init_struct_adc);
	
	// Configure DMA mode
	dma_circulation_enable(DMA_CH0);
	dma_memory_to_memory_disable(DMA_CH0);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH0, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH0, 2);
	
	// Enable DMA channel 0
	dma_channel_enable(DMA_CH0);
	
	adc_channel_length_config(ADC_REGULAR_CHANNEL, 2);

	#ifdef VBATT
		adc_regular_channel_config(0, PIN_TO_CHANNEL(VBATT), ADC_SAMPLETIME_13POINT5);
	#endif
	#ifdef CURRENT_DC
		adc_regular_channel_config(1, PIN_TO_CHANNEL(CURRENT_DC), ADC_SAMPLETIME_13POINT5);
	#endif
	
	adc_data_alignment_config(ADC_DATAALIGN_RIGHT);
	
	// Set trigger of ADC
	adc_external_trigger_config(ADC_REGULAR_CHANNEL, ENABLE);
	adc_external_trigger_source_config(ADC_REGULAR_CHANNEL, ADC_EXTTRIG_REGULAR_NONE);

	// Disable the temperature sensor, Vrefint and vbat channel
	adc_tempsensor_vrefint_disable();
	
	TARGET_adc_vbat_disable();
	
	// ADC analog watchdog disable
	adc_watchdog_disable();
	
	// Enable ADC (must be before calibration)
	adc_enable();
	
	// Calibrate ADC values
	adc_calibration_enable();
	
	// Enable DMA request
	adc_dma_mode_enable();
    
	// Set ADC to scan mode
	adc_special_function_config(ADC_SCAN_MODE, ENABLE);
}

/*
//----------------------------------------------------------------------------
// Initializes the usart master slave
//----------------------------------------------------------------------------
void USART_MasterSlave_init(void)
{
	#ifdef USART_MASTERSLAVE
		
		// Enable ADC and DMA clock
		rcu_periph_clock_enable(USART_MASTERSLAVE_RCU);	// RCU_USART1
		rcu_periph_clock_enable(RCU_DMA);
		
		// Init USART for 115200 baud, 8N1
		usart_baudrate_set(USART_MASTERSLAVE, 115200);
		usart_parity_config(USART_MASTERSLAVE, USART_PM_NONE);
		usart_word_length_set(USART_MASTERSLAVE, USART_WL_8BIT);
		usart_stop_bit_set(USART_MASTERSLAVE, USART_STB_1BIT);
		usart_oversample_config(USART_MASTERSLAVE, USART_OVSMOD_16);
		
		// Enable both transmitter and receiver
		usart_transmit_config(USART_MASTERSLAVE, USART_TRANSMIT_ENABLE);
		usart_receive_config(USART_MASTERSLAVE, USART_RECEIVE_ENABLE);
		
		//syscfg_dma_remap_enable(SYSCFG_DMA_REMAP_USART0RX|SYSCFG_DMA_REMAP_USART0TX);
	
		// Enable USART
		usart_enable(USART_MASTERSLAVE);
		
		// Interrupt channel 3/4 enable
		TARGET_nvic_irq_enable(DMA_Channel3_4_IRQn, 2, 0);
		
		// Initialize DMA channel 4 for USART_SLAVE RX
		dma_deinit(DMA_CH4);
		dma_init_struct_usart.direction = DMA_PERIPHERAL_TO_MEMORY;
		dma_init_struct_usart.memory_addr = (uint32_t)usartMasterSlave_rx_buf;
		dma_init_struct_usart.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
		dma_init_struct_usart.memory_width = DMA_MEMORY_WIDTH_8BIT;
		dma_init_struct_usart.number = USART_MASTERSLAVE_RX_BUFFERSIZE;
		dma_init_struct_usart.periph_addr = USART_MASTERSLAVE_DATA_RX_ADDRESS;
		dma_init_struct_usart.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
		dma_init_struct_usart.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
		dma_init_struct_usart.priority = DMA_PRIORITY_ULTRA_HIGH;
		dma_init(DMA_CH4, &dma_init_struct_usart);
		
		// Configure DMA mode
		dma_circulation_enable(DMA_CH4);
		dma_memory_to_memory_disable(DMA_CH4);

		// USART DMA enable for transmission and receive
		usart_dma_receive_config(USART_MASTERSLAVE, USART_DENR_ENABLE);
		
		// Enable DMA transfer complete interrupt
		dma_interrupt_enable(DMA_CH4, DMA_CHXCTL_FTFIE);
		
		// At least clear number of remaining data to be transferred by the DMA 
		dma_transfer_number_config(DMA_CH4, 1);
		
		// Enable dma receive channel
		dma_channel_enable(DMA_CH4);
	#endif
}
*/

void USART1_Init(uint32_t iBaud)
{
#ifdef HAS_USART1
	
	// Init USART1
	#if defined(USART1_REMOTE) && defined(REMOTE_UARTBUS)	// no pullup resistors with multiple boards on the UartBus - Esp32/Arduino (Serial.begin) have to setup pullups
		#define USART1_PUPD	GPIO_PUPD_NONE
	#else
		#define USART1_PUPD	GPIO_PUPD_PULLUP
	#endif
	pinModeAF(USART1_TX, AF_USART1_TX, USART1_PUPD, GPIO_OSPEED_50MHZ);	// // GD32F130: GPIO_AF_1 = USART
	pinModeAF(USART1_RX, AF_USART1_RX, USART1_PUPD, GPIO_OSPEED_50MHZ);	
	//gpio_mode_set(USART1_TX_PORT , GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART1_TX_PIN);	
	//gpio_mode_set(USART1_RX_PORT , GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART1_RX_PIN);
	//gpio_output_options_set(USART1_TX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART1_TX_PIN);
	//gpio_output_options_set(USART1_RX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART1_RX_PIN);	
	//gpio_af_set(USART1_TX_PORT, GPIO_AF_1, USART1_TX_PIN);	// GD32F130: GPIO_AF_1 = USART
	//gpio_af_set(USART1_RX_PORT, GPIO_AF_1, USART1_RX_PIN);
	
	
	// Enable ADC and DMA clock
	rcu_periph_clock_enable(RCU_USART1);
	rcu_periph_clock_enable(RCU_DMA);
	
	// Init USART for 115200 baud, 8N1
	usart_baudrate_set(USART1, iBaud);
	usart_parity_config(USART1, USART_PM_NONE);
	usart_word_length_set(USART1, USART_WL_8BIT);
	usart_stop_bit_set(USART1, USART_STB_1BIT);
	usart_oversample_config(USART1, USART_OVSMOD_16);
	
	// Enable both transmitter and receiver
	usart_transmit_config(USART1, USART_TRANSMIT_ENABLE);
	usart_receive_config(USART1, USART_RECEIVE_ENABLE);
	
	//syscfg_dma_remap_enable(SYSCFG_DMA_REMAP_USART0RX|SYSCFG_DMA_REMAP_USART0TX);

	// Enable USART
	usart_enable(USART1);
	
	// Interrupt channel 3/4 enable
	TARGET_nvic_irq_enable(DMA_Channel3_4_IRQn, 2, 0);
	
	// Initialize DMA channel 4 for USART_SLAVE RX
	dma_deinit(DMA_CH4);
	dma_init_struct_usart.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_init_struct_usart.memory_addr = (uint32_t)usart1_rx_buf;
	dma_init_struct_usart.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_init_struct_usart.memory_width = DMA_MEMORY_WIDTH_8BIT;
	dma_init_struct_usart.number = 1;
	dma_init_struct_usart.periph_addr = USART1_DATA_RX_ADDRESS;
	dma_init_struct_usart.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_init_struct_usart.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
	dma_init_struct_usart.priority = DMA_PRIORITY_ULTRA_HIGH;
	dma_init(DMA_CH4, &dma_init_struct_usart);
	
	// Configure DMA mode
	dma_circulation_enable(DMA_CH4);
	dma_memory_to_memory_disable(DMA_CH4);

