whiteb3ar/hoverboard-firmware-hack-FOC/Src/Platform/Gd32F130C8T6/setup.c
	// USART DMA enable for transmission and receive
	usart_dma_receive_config(USART1, USART_DENR_ENABLE);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH4, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH4, 1);
	
	// Enable dma receive channel
	dma_channel_enable(DMA_CH4);
#endif
}

void USART0_Init(uint32_t iBaud)
{
#ifdef HAS_USART0
	
	// Init USART0
	#if defined(USART0_REMOTE) && defined(REMOTE_UARTBUS)	// no pullup resistors with multiple boards on the UartBus - Esp32/Arduino (Serial.begin) have to setup pullups
		#define USART0_PUPD	GPIO_PUPD_NONE
	#else
		#define USART0_PUPD	GPIO_PUPD_PULLUP
	#endif
	pinModeAF(USART0_TX, AF_USART0_TX, USART0_PUPD,GPIO_OSPEED_50MHZ);	// // GD32F130: GPIO_AF_0 = USART, GPIO_AF_1 = I2C
	pinModeAF(USART0_RX, AF_USART0_RX, USART0_PUPD,GPIO_OSPEED_50MHZ);	
	//gpio_mode_set(USART0_TX_PORT , GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART0_TX_PIN);	
	//gpio_mode_set(USART0_RX_PORT , GPIO_MODE_AF, GPIO_PUPD_PULLUP, USART0_RX_PIN);
	//gpio_output_options_set(USART0_TX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART0_TX_PIN);
	//gpio_output_options_set(USART0_RX_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, USART0_RX_PIN);	
	//gpio_af_set(USART0_TX_PORT, GPIO_AF_0, USART0_TX_PIN);	// GD32F130: GPIO_AF_0 = USART, GPIO_AF_1 = I2C
	//gpio_af_set(USART0_RX_PORT, GPIO_AF_0, USART0_RX_PIN);
	
		// Enable ADC and DMA clock
	rcu_periph_clock_enable(RCU_USART0);
	rcu_periph_clock_enable(RCU_DMA);
	
	// Init USART for USART0_BAUD baud, 8N1
	usart_baudrate_set(USART0, iBaud);
	usart_parity_config(USART0, USART_PM_NONE);
	usart_word_length_set(USART0, USART_WL_8BIT);
	usart_stop_bit_set(USART0, USART_STB_1BIT);
	usart_oversample_config(USART0, USART_OVSMOD_16);
	
	
	// Enable both transmitter and receiver
	usart_transmit_config(USART0, USART_TRANSMIT_ENABLE);
	//usart_invert_config(USART0, USART_SWAP_ENABLE);	// HarleyBob
	usart_receive_config(USART0, USART_RECEIVE_ENABLE);
	
	// Enable USART
	usart_enable(USART0);
	
	// Interrupt channel 1/2 enable
	TARGET_nvic_irq_enable(DMA_Channel1_2_IRQn, 2, 0);
	
	// Initialize DMA channel 2 for USART0 RX
	dma_deinit(DMA_CH2);
	dma_init_struct_usart.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_init_struct_usart.memory_addr = (uint32_t)usart0_rx_buf;
	dma_init_struct_usart.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_init_struct_usart.memory_width = DMA_MEMORY_WIDTH_8BIT;
	dma_init_struct_usart.number = 1;
	dma_init_struct_usart.periph_addr = USART0_DATA_RX_ADDRESS;
	dma_init_struct_usart.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_init_struct_usart.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
	dma_init_struct_usart.priority = DMA_PRIORITY_ULTRA_HIGH;
	dma_init(DMA_CH2, &dma_init_struct_usart);
	
	// Configure DMA mode
	dma_circulation_enable(DMA_CH2);
	dma_memory_to_memory_disable(DMA_CH2);

	// USART DMA enable for transmission and receive
	usart_dma_receive_config(USART0, USART_DENR_ENABLE);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH2, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH2, 1);
	
	// Enable dma receive channel
	dma_channel_enable(DMA_CH2);
	
#endif
}

/*
//----------------------------------------------------------------------------
// Initializes the usart steer/bluetooth
//----------------------------------------------------------------------------
void USART_Steer_COM_init(void)
{
#ifdef USART_STEER_COM_BAUD
	
		// Enable ADC and DMA clock
	rcu_periph_clock_enable(USART_STEER_RCU);
	rcu_periph_clock_enable(RCU_DMA);
	
	// Init USART for 19200 baud, 8N1
	usart_baudrate_set(USART_STEER_COM, USART_STEER_COM_BAUD);
	usart_parity_config(USART_STEER_COM, USART_PM_NONE);
	usart_word_length_set(USART_STEER_COM, USART_WL_8BIT);
	usart_stop_bit_set(USART_STEER_COM, USART_STB_1BIT);
	usart_oversample_config(USART_STEER_COM, USART_OVSMOD_16);
	
	
	// Enable both transmitter and receiver
	usart_transmit_config(USART_STEER_COM, USART_TRANSMIT_ENABLE);
	//usart_invert_config(USART_STEER_COM, USART_SWAP_ENABLE);	// HarleyBob
	usart_receive_config(USART_STEER_COM, USART_RECEIVE_ENABLE);
	
	// Enable USART
	usart_enable(USART_STEER_COM);
	
	// Interrupt channel 1/2 enable
	TARGET_nvic_irq_enable(DMA_Channel1_2_IRQn, 2, 0);
	
	// Initialize DMA channel 2 for USART_STEER_COM RX
	dma_deinit(DMA_CH2);
	dma_init_struct_usart.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_init_struct_usart.memory_addr = (uint32_t)usartSteer_COM_rx_buf;
	dma_init_struct_usart.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_init_struct_usart.memory_width = DMA_MEMORY_WIDTH_8BIT;
	dma_init_struct_usart.number = USART_STEER_COM_RX_BUFFERSIZE;
	dma_init_struct_usart.periph_addr = USART_STEER_COM_DATA_RX_ADDRESS;
	dma_init_struct_usart.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_init_struct_usart.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
	dma_init_struct_usart.priority = DMA_PRIORITY_ULTRA_HIGH;
	dma_init(DMA_CH2, &dma_init_struct_usart);
	
	// Configure DMA mode
	dma_circulation_enable(DMA_CH2);
	dma_memory_to_memory_disable(DMA_CH2);

	// USART DMA enable for transmission and receive
	usart_dma_receive_config(USART_STEER_COM, USART_DENR_ENABLE);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH2, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH2, 1);
	
	// Enable dma receive channel
	dma_channel_enable(DMA_CH2);
#endif
}
*/
